// filter and find almost same 

//  ফাইন্ড হলো যদি একাধিক থাকে প্রথমটাকে দিবে..আর যদি না থাকে আনডিফাইন্ড দিবে।

const playersHeight=[71,75, 70, 60, 67, 85,87, 71, 80];

const selected=playersHeight.find(player => player > 70);
console.log(selected);

/*
1. Map (loop  চালাবে প্রত্যেকটাতে নিজের একটা রেসাল্ট এ্যারেতে রাখবে ফাইনাল রেজাল্ট রিটান করবে।)
 2. for Each: ( map  এর মত বাট কোন কিছু রিটার্ন করবে না।)
 3. filter: (শর্তসাপেক্ষ শর্ত ঠিক থাকলে শর্ত মোতাবেক রেজাল্ট দিবে আর যদি না থাকে আনডিফাইন্ড দিবে (বাছাই করবে))
 4. find: ( শর্ত চালাবে যা পাবে একাধিক এলিমেন্ট থাকলে  ও প্রথম এলিমেন্ট ই দিবে আর না থাকলে আনডিফািইন্ড দিবে)
 5. reduce: ( সবগুলো উপাধান থেকে নিয়ে নিয়ে আলটিমেটলি একটা জিনিশ বানাবে)